{
    "basic_info": {
      "description_header": "Hello",
      "description": "I'm a software engineer residing in the Dallas-FortWorth area. I have always been enchanted with the world of technology and innovaton and after graduating from the University of Texas at Arlington, I took the leap and transitioned from the healthcare industry to start my tech journey in late 2022. Fast forward to now, summer 2023, I have expanded my skillset by completing an advanced software engineering immersive where I gained valuable technical skills and development expertise. As a detail-oriented person, I have a passion for developing, designing and maintaining websites/applications with a focus on clean coding practices and user-friendliness. My goal is to continue learning and growing as a software engineer and to contribute to innovative and meaningful projects that make a positive impact on the world. In my free time, I love to read, paint, cook, hangout with friends/family and travel. My 5 year old cat, Luna, loves to sit with me while I'm coding and is my version of a programmer's rubber duck.",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "Tripper",
        "description": "Tripper is a travel journal designed for the new age nomad. Our team of creators has made a beautiful and intuitive application that allows users to create a history of all their amazing travels including each stop made along the way. Tripper travelers can include their favorite photo as the main display of the trip and let the smart app provide a professional picture for each related stop. All the fun had along the way can be documented in each stop, and an overview of the entire trip will remind our users what they did every time they go to the home page.",
        "images": [
          "images/tripper/flight.png"
        ],
        "github": "https://github.com/laylahashmi/Tripper",
        "demo": "https://domraro.gitlab.io/tripper2.0/",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "Javascript"
          },
          {
            "class": "devicon-fastapi-plain",
            "name": "FastAPI"
          },
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-mongodb-plain",
            "name": "MongoDB"
          },
          {
            "class": "devicon-bootstrap-plain",
            "name": "Bootstrap"
          },
          {
            "class": "devicon-redux-plain",
            "name": "Redux"
          },
          {
            "class": "devicon-git-plain",
            "name": "Git"
          }
        ]
      },
      {
        "title": "AutoScape",
        "description": "AutoScape was developed to manage various aspects of an automobile dealership including inventory, service center, and sales. Polling was leveraged to ensure data integrity and syncing between three databases linked to four microservices. I implemented form submission for client-side appointment scheduling and search/filter components to enhance user experience and increase website traffic. The sales management module is a user-friendly interface built using React, allowing dealerships to easily add and delete vehicle sales from the system, as well as keep track of all salesperson records.  Additionally, the application has a feature of VIP status, which is implemented for automobiles that have been serviced more than once.",
        "images": [
          "images/autoscape/car.png"
        ],
        "github": "https://github.com/laylahashmi/AutoScape",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-django-plain",
            "name": "Django"
          },
          {
            "class": "devicon-python-plain",
            "name": "Python"
          },
          {
            "class": "devicon-postgresql-plain",
            "name": "PostgresQL"
          },
          {
            "class": "devicon-bootstrap-plain",
            "name": "Bootstrap"
          },
          {
            "class": "devicon-docker-plain",
            "name": "Docker"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS"
          }
        ]
      },
      {
        "title": "Task Manager",
        "description": "Designed to help users manage their tasks efficiently for individual and/or group projects. It has user-focused features such as login, logout, and signup that make it easy for users to access and utilize the app. With this app, users can add multiple separate projects where they can edit, create, and delete certain tasks. Additionally, a user can assign tasks to specific team members, increasing team efficiency and decreasing project completion time/conflicts!",
        "images": [
          "images/peersmeet/planner.png"
        ],
        "github": "https://github.com/laylahashmi/task-sphere",
        "technologies": [
          {
            "class": "devicon-html5-plain",
            "name": "HTML 5"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS"
          },
          {
            "class": "devicon-python-plain",
            "name": "Python"
          },
          {
            "class": "devicon-django-plain",
            "name": "Django"
          },
          {
            "class": "devicon-sqlite-plain",
            "name": "SQLite3"
          }
        ]
      },
      {
        "title": "Door Hopper",
        "description": "Designed specifically for a door to door solar panel sales company, Door Hopper uses the Google API to keep track of all addresses/locations of the company's potential customers. It features a client-side form where customers can leave their information and schedule an appointment for a consult with a sales professional or for solar panel installation with a technician. It has a secure database of all customers and their information which only certain company members can access.",
        "images": [
          "images/doorhopper/solar-energy.png"
        ],
        "url": "https://github.com/TracerLabs-sourcecode/door-hopper",
        "technologies": [
          {
            "class": "devicon-amazonwebservices-original",
            "name": "AWS"
          },
          {
            "class": "devicon-react-plain",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "Javascript"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS"
          },
          {
            "class": "devicon-postgresql-plain",
            "name": "PostgresQL"
          }
        ]
      },
      {
        "title": "A Dusty Portfolio",
        "description": "This was the first portfolio I ever developed for myself, it is an older model that I like to look back on and see how far I've come. I wanted to include it because it was built from the ground up utilizing NextJS for the backend and React for the frontend. I also implemented Incremental Static Regeneration with Sanity.io which allowed me to easily update contents without needing to redeploy with each update. The UI design was thanks to my skills with Tailwind CSS and the animations were made with Framer Motion.",
        "images": [
          "images/portfolio/profile.png"
        ],
        "github": "https://github.com/laylahashmi/portfolio",
        "demo": "https://laylasportfolio.vercel.app",
        "technologies": [
          {
            "class": "devicon-typescript-plain",
            "name": "Typescript"
          },
          {
            "class": "devicon-react-plain",
            "name": "React"
          },
          {
            "class": "devicon-tailwindcss-plain",
            "name": "Tailwind"
          },
          {
            "class": "devicon-nextjs-plain",
            "name": "NextJS"
          },
          {
          "class": "devicon-git-plain",
          "name": "Git"
          },
          {
            "class": "devicon-mysql-plain",
            "name": "MySQL"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "DefOpenSource",
        "title": "Front-End Developer",
        "years": "10.2019 - present",
        "mainTech": [
          "Angular 8/9/10"
        ],
        "technologies": [
          "REST API",
          "RxJS",
          "JavaScript",
          "Bootstrap",
          "MDBootstrap",
          "EF Core",
          ".NET Core",
          "SignalR",
          "Angular Material"
        ]
      },
      {
        "company": "Serros Solutions",
        "title": "Intern",
        "years": "01.2018 - 09.2019",
        "mainTech": [
          "Angular 7/8"
        ],
        "technologies": [
          "RxJS",
          "Django",
          "PHP",
          "JavaScript",
          "DHTMLX Gantt"
        ]
      }
    ]
  }
